{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# MULTI-AGENT SYSTEM (IMPROVED)\n",
    "\n",
    "This system is similar to the code_executor_chat.\n",
    "The improvement will be on making tools available and adding two other agents:\n",
    "- recommender; another LLM agent that needs to answer the user. In order to do that it can call other agents (coder and a function caller).\n",
    "- function caller; This is a simple agent that can only call tools to retrieve data from, for example, wikipedia.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from autogen import AssistantAgent, GroupChatManager, GroupChat\n",
    "from autogen import register_function, config_list_from_json\n",
    "from autogen.agentchat.contrib.retrieve_user_proxy_agent import RetrieveUserProxyAgent, TEXT_FORMATS\n",
    "from pathlib import Path\n",
    "import os\n",
    "\n",
    "from CypherExecutor import CypherCodeExecutor\n",
    "from tools.neo4j_tools import save_schema\n",
    "from tools.tools import wiki_search"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Save database schema and then store the path to the directory\n",
    "save_schema()\n",
    "p = Path(__name__).parent.resolve() / \"schemas\"\n",
    "\n",
    "\n",
    "#### LLM MODEL CONFIGURATION #####\n",
    "\n",
    "config_list = config_list_from_json(env_or_file=\"CONFIG_LIST\", filter_dict={\"model\": \"gpt-4o-mini\"})\n",
    "config_list[0][\"api_key\"] = os.environ.get(\"GITHUB_TOKEN\")\n",
    "\n",
    "llm_config  = {\"config_list\": config_list, \"temperature\": 0.2}\n",
    "\n",
    "c_prompt = \"\"\"\n",
    "You are a data scientist.\n",
    "\n",
    "### RULES ###\n",
    "    - Use your knowledge to generate cypher queries to retrieve data from the database.\n",
    "    - If the topic of the conversation is related to the database schema you need to stay silent.\n",
    "    - When generating a query you must use Cypher format.\n",
    "    - Format results as a table.\n",
    "    - Stay silent if you won't create a query or if you won't format the results.\n",
    "\n",
    "### DATABASE SCHEMA ### \n",
    "{input_context}\n",
    "\"\"\"\n",
    "\n",
    "r_prompt = \"\"\"\n",
    "You are a helpful AI assistant.\n",
    "\n",
    "### RULES ### \n",
    "  - If the topic needs extra information or data you have to ask coder assistant \n",
    "    and use the provided tools. \n",
    "  - Reply 'TERMINATE' if messages are repeating or the task is complete.\n",
    "\n",
    "\"\"\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "def termination_msg(x):\n",
    "    return isinstance(x, dict) and \"TERMINATE\" in x[\"content\"][-10:].upper()\n",
    "\n",
    "recommender   = AssistantAgent(\n",
    "    \"recommender\",\n",
    "    llm_config=llm_config,  # Turn off LLM for this agent.\n",
    "    is_termination_msg=termination_msg,\n",
    "    system_message=r_prompt, \n",
    "    description=\"Assistant that gives tasks\") \n",
    "\n",
    "doc_retriever = RetrieveUserProxyAgent(\n",
    "    name=\"doc_retriever\",\n",
    "    is_termination_msg=termination_msg,\n",
    "    max_consecutive_auto_reply=3,\n",
    "    human_input_mode=\"NEVER\",\n",
    "    retrieve_config={\n",
    "        \"docs_path\": str(p), # A list of urls, dirs or files can be passed\n",
    "        \"extra-docs\": True,\n",
    "        \"model\": config_list[0][\"model\"],\n",
    "        \"get_or_create\": True,\n",
    "        \"customized_prompt\": \"\"\"CONTEXT:\\n{input_context}\\n\\nQUESTION:\\n{input_question}\"\"\"\n",
    "    },\n",
    "    code_execution_config=False,\n",
    "    description=\"Assistant who has extra content retrieval power.\"\n",
    ")\n",
    "\n",
    "# Coder generates cypher queries with the help of the db schema \n",
    "coder      = AssistantAgent(\n",
    "    name=\"coder\",\n",
    "    is_termination_msg=termination_msg,\n",
    "    system_message=c_prompt,\n",
    "    llm_config=llm_config,\n",
    "    description=\"Data scientist that creates cypher queries.\"\n",
    ")\n",
    "\n",
    "# Executor runs the query in a jupyter notebook\n",
    "executor   = AssistantAgent(\n",
    "    name=\"executor\",\n",
    "    is_termination_msg=termination_msg,\n",
    "    human_input_mode=\"NEVER\", # THIS IS NOT SECURE! \n",
    "    description= \"Executes queries.\",\n",
    "    code_execution_config={\"executor\": CypherCodeExecutor()}\n",
    "    )\n",
    "\n",
    "# Fun_caller calls a tool \n",
    "fun_caller = AssistantAgent(\n",
    "    \"fun_caller\",\n",
    "    llm_config=False,  # Turn off LLM for this agent.\n",
    "    is_termination_msg=termination_msg,\n",
    "    description=\"Executes tools.\")\n",
    "\n",
    "\n",
    "#### REGISTER FUNCTIONS ####\n",
    "\n",
    "register_function(wiki_search,\n",
    "                  caller= recommender,\n",
    "                  executor= fun_caller,\n",
    "                  description=\"Service that will retrieve information about 1 or 2 words.\")\n",
    "\n",
    "#############################\n",
    "\n",
    " \n",
    "PROBLEM  = \"Can you reccomend me a movie directed by Paul w.s. anderson?\"\n",
    "\n",
    "def _reset_agents():\n",
    "    \"\"\"\n",
    "    This function reset all the agents used for the group chat.\n",
    "    This should be used every time you start a new conversation.\n",
    "    \"\"\"\n",
    "    doc_retriever.reset()\n",
    "    coder.reset()\n",
    "    executor.reset()\n",
    "    recommender.reset()\n",
    "\n",
    "def state_transition(last_speaker, groupchat):\n",
    "    \"\"\"\n",
    "    This function simply return the next speaker based on the last one.\n",
    "    In this case we decided that doc_retriever should speak only to initiate chat\n",
    "    and then the chat is from coder to executor in a sort of loop.\n",
    "    \"\"\"\n",
    "\n",
    "    m = groupchat.messages[-1]\n",
    "    \n",
    "    if last_speaker in [fun_caller, doc_retriever]: return recommender\n",
    "    elif last_speaker is executor: return coder \n",
    "    elif last_speaker is recommender: \n",
    "        if \"tool_calls\" in m: return fun_caller\n",
    "        else: return coder\n",
    "    \n",
    "    elif last_speaker is coder:\n",
    "        if \"```cypher\" in m[\"content\"]: return executor\n",
    "        else: return recommender\n",
    "        \n",
    "def rag_chat():\n",
    "    \"\"\"\n",
    "    Resets the agents, creates the group chat and then initiate chat.\n",
    "    The first agent to speak is the doc_retriever that will only pass:\n",
    "        - prompt\n",
    "        - files (like the schema), that is the context\n",
    "        - question\n",
    "    \"\"\"\n",
    "    _reset_agents()\n",
    "    groupchat = GroupChat(agents=[doc_retriever, recommender, coder, fun_caller, executor], messages=[], \n",
    "                          max_round=15, speaker_selection_method=state_transition)\n",
    "    manager   = GroupChatManager(groupchat=groupchat, llm_config=llm_config)\n",
    "\n",
    "    doc_retriever.initiate_chat(manager,message=doc_retriever.message_generator, problem=PROBLEM,n_results=3)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2024-10-03 10:33:39,678 - autogen.agentchat.contrib.retrieve_user_proxy_agent - INFO - \u001b[32mUse the existing collection `autogen-docs`.\u001b[0m\n",
      "2024-10-03 10:33:39,695 - autogen.agentchat.contrib.retrieve_user_proxy_agent - INFO - Found 1 chunks.\u001b[0m\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Trying to create collection.\n",
      "VectorDB returns doc_ids:  [['ca5f356a', 'c99bc2e0', '985292cd']]\n",
      "\u001b[32mAdding content of doc ca5f356a to context.\u001b[0m\n",
      "\u001b[32mAdding content of doc c99bc2e0 to context.\u001b[0m\n",
      "\u001b[32mAdding content of doc 985292cd to context.\u001b[0m\n",
      "\u001b[33mdoc_retriever\u001b[0m (to chat_manager):\n",
      "\n",
      "CONTEXT:\n",
      "[\n",
      "    {\n",
      "        \"nodes\": [\n",
      "            {\n",
      "                \"name\": \"Movie\",\n",
      "                \"indexes\": [],\n",
      "                \"constraints\": [],\n",
      "                \"properties\": [\n",
      "                    \"tagline\",\n",
      "                    \"title\",\n",
      "                    \"released\"\n",
      "                ]\n",
      "            },\n",
      "            {\n",
      "                \"name\": \"Person\",\n",
      "                \"indexes\": [],\n",
      "                \"constraints\": [],\n",
      "                \"properties\": [\n",
      "                    \"born\",\n",
      "                    \"name\"\n",
      "                ]\n",
      "            }\n",
      "        ],\n",
      "        \"relationships\": [\n",
      "            {\n",
      "                \"name\": \"ACTED_IN\",\n",
      "                \"node1\": \"Person\",\n",
      "                \"node2\": \"Movie\",\n",
      "                \"properties\": [\n",
      "                    \"roles\"\n",
      "                ]\n",
      "            },\n",
      "            {\n",
      "                \"name\": \"REVIEWED\",\n",
      "                \"node1\": \"Person\",\n",
      "                \"node2\": \"Movie\",\n",
      "                \"properties\": [\n",
      "                    \"summary\",\n",
      "                    \"rating\"\n",
      "                ]\n",
      "            },\n",
      "            {\n",
      "                \"name\": \"PRODUCED\",\n",
      "                \"node1\": \"Person\",\n",
      "                \"node2\": \"Movie\",\n",
      "                \"properties\": [\n",
      "                    null\n",
      "                ]\n",
      "            },\n",
      "            {\n",
      "                \"name\": \"WROTE\",\n",
      "                \"node1\": \"Person\",\n",
      "                \"node2\": \"Movie\",\n",
      "                \"properties\": [\n",
      "                    null\n",
      "                ]\n",
      "            },\n",
      "            {\n",
      "                \"name\": \"FOLLOWS\",\n",
      "                \"node1\": \"Person\",\n",
      "                \"node2\": \"Person\",\n",
      "                \"properties\": [\n",
      "                    null\n",
      "                ]\n",
      "            },\n",
      "            {\n",
      "                \"name\": \"DIRECTED\",\n",
      "                \"node1\": \"Person\",\n",
      "                \"node2\": \"Movie\",\n",
      "                \"properties\": [\n",
      "                    null\n",
      "                ]\n",
      "            }\n",
      "        ]\n",
      "    }\n",
      "]\n",
      "[\n",
      "    {\n",
      "        \"nodes\": [\n",
      "            {\n",
      "                \"name\": \"Movie\",\n",
      "                \"indexes\": [],\n",
      "                \"constraints\": [\n",
      "                    \"Constraint( id=3, name='movieId', type='UNIQUENESS', schema=(:Movie {id}), ownedIndex=2 )\"\n",
      "                ],\n",
      "                \"properties\": [\n",
      "                    \"movieId\",\n",
      "                    \"plot\",\n",
      "                    \"title\"\n",
      "                ]\n",
      "            },\n",
      "            {\n",
      "                \"name\": \"Person\",\n",
      "                \"indexes\": [],\n",
      "                \"constraints\": [\n",
      "                    \"Constraint( id=5, name='personId', type='UNIQUENESS', schema=(:Person {id}), ownedIndex=4 )\"\n",
      "                ],\n",
      "                \"properties\": [\n",
      "                    \"name\",\n",
      "                    \"tmdbId\"\n",
      "                ]\n",
      "            }\n",
      "        ],\n",
      "        \"relationships\": [\n",
      "            {\n",
      "                \"name\": \"ACTED_IN\",\n",
      "                \"node1\": \"Person\",\n",
      "                \"node2\": \"Movie\",\n",
      "                \"properties\": [\n",
      "                    \"role\"\n",
      "                ]\n",
      "            }\n",
      "        ]\n",
      "    }\n",
      "]\n",
      "[\n",
      "    {\n",
      "        \"nodes\": [\n",
      "            {\n",
      "                \"name\": \"Movie\",\n",
      "                \"indexes\": [],\n",
      "                \"constraints\": [\n",
      "                    \"Constraint( id=3, name='movieId', type='UNIQUENESS', schema=(:Movie {id}), ownedIndex=2 )\"\n",
      "                ],\n",
      "                \"properties\": [\n",
      "                    \"movieId\",\n",
      "                    \"plot\",\n",
      "                    \"title\",\n",
      "                    \"tagline\",\n",
      "                    \"released\"\n",
      "                ]\n",
      "            },\n",
      "            {\n",
      "                \"name\": \"Person\",\n",
      "                \"indexes\": [],\n",
      "                \"constraints\": [\n",
      "                    \"Constraint( id=5, name='personId', type='UNIQUENESS', schema=(:Person {id}), ownedIndex=4 )\"\n",
      "                ],\n",
      "                \"properties\": [\n",
      "                    \"name\",\n",
      "                    \"tmdbId\",\n",
      "                    \"born\"\n",
      "                ]\n",
      "            }\n",
      "        ],\n",
      "        \"relationships\": [\n",
      "            {\n",
      "                \"name\": \"ACTED_IN\",\n",
      "                \"node1\": \"Person\",\n",
      "                \"node2\": \"Movie\",\n",
      "                \"properties\": [\n",
      "                    \"roles\"\n",
      "                ]\n",
      "            },\n",
      "            {\n",
      "                \"name\": \"REVIEWED\",\n",
      "                \"node1\": \"Person\",\n",
      "                \"node2\": \"Movie\",\n",
      "                \"properties\": [\n",
      "                    \"summary\",\n",
      "                    \"rating\"\n",
      "                ]\n",
      "            },\n",
      "            {\n",
      "                \"name\": \"PRODUCED\",\n",
      "                \"node1\": \"Person\",\n",
      "                \"node2\": \"Movie\",\n",
      "                \"properties\": [\n",
      "                    null\n",
      "                ]\n",
      "            },\n",
      "            {\n",
      "                \"name\": \"WROTE\",\n",
      "                \"node1\": \"Person\",\n",
      "                \"node2\": \"Movie\",\n",
      "                \"properties\": [\n",
      "                    null\n",
      "                ]\n",
      "            },\n",
      "            {\n",
      "                \"name\": \"FOLLOWS\",\n",
      "                \"node1\": \"Person\",\n",
      "                \"node2\": \"Person\",\n",
      "                \"properties\": [\n",
      "                    null\n",
      "                ]\n",
      "            },\n",
      "            {\n",
      "                \"name\": \"DIRECTED\",\n",
      "                \"node1\": \"Person\",\n",
      "                \"node2\": \"Movie\",\n",
      "                \"properties\": [\n",
      "                    null\n",
      "                ]\n",
      "            }\n",
      "        ]\n",
      "    }\n",
      "]\n",
      "\n",
      "\n",
      "QUESTION:\n",
      "Can you reccomend me a movie directed by Paul w.s. anderson?\n",
      "\n",
      "--------------------------------------------------------------------------------\n",
      "\u001b[32m\n",
      "Next speaker: recommender\n",
      "\u001b[0m\n",
      "\u001b[33mrecommender\u001b[0m (to chat_manager):\n",
      "\n",
      "\u001b[32m***** Suggested tool call (call_FsRIvmVp965YUXF8yR18SxY0): wiki_search *****\u001b[0m\n",
      "Arguments: \n",
      "{\"keyword\":\"Paul W.S. Anderson\"}\n",
      "\u001b[32m****************************************************************************\u001b[0m\n",
      "\n",
      "--------------------------------------------------------------------------------\n",
      "\u001b[32m\n",
      "Next speaker: fun_caller\n",
      "\u001b[0m\n",
      "\u001b[35m\n",
      ">>>>>>>> EXECUTING FUNCTION wiki_search...\u001b[0m\n",
      "\u001b[33mfun_caller\u001b[0m (to chat_manager):\n",
      "\n",
      "\u001b[33mfun_caller\u001b[0m (to chat_manager):\n",
      "\n",
      "\u001b[32m***** Response from calling tool (call_FsRIvmVp965YUXF8yR18SxY0) *****\u001b[0m\n",
      "Paul William Scott Anderson (born 4 March 1965) is an English film director, screenwriter, and producer who often makes science fiction films and video game adaptations.\n",
      "Anderson made his feature film debut with the British independent film Shopping (1994); he found commercial success with his second film, Mortal Kombat (1995), made in the US, based on the first couple of video games of the same name by Midway Games. He is best known as the creative voice behind the first six live-action films of the Resident Evil film series (2002–2016), which stars Milla Jovovich (whom he married in 2009), and is based on the Capcom video game series of the same name. The series' first six live-action films, of which Anderson directed four, have collectively grossed over $1 billion worldwide. Other notable films of Anderson's are Event Horizon (1997), an initial critical and commercial disappointment that found renewed appreciation on home media; Alien vs. Predator (2004), based on the crossover concept of the same name between the Alien and Predator franchises; Death Race (2008), a remake/prequel to 1975's Death Race 2000, and the epic romantic historical disaster Pompeii (2014).\n",
      "Anderson and producer Jeremy Bolt founded Impact Pictures in 1992, under which most of Anderson's films have been made.\n",
      "\u001b[32m**********************************************************************\u001b[0m\n",
      "\n",
      "--------------------------------------------------------------------------------\n",
      "\u001b[32m\n",
      "Next speaker: recommender\n",
      "\u001b[0m\n",
      "\u001b[33mrecommender\u001b[0m (to chat_manager):\n",
      "\n",
      "Paul W.S. Anderson is known for several notable films. Here are a few recommendations:\n",
      "\n",
      "1. **Event Horizon (1997)** - A science fiction horror film that has gained a cult following.\n",
      "2. **Resident Evil series (2002–2016)** - He directed four of the six films in this popular franchise based on the video game series.\n",
      "3. **Alien vs. Predator (2004)** - A crossover film that combines elements from both the Alien and Predator franchises.\n",
      "4. **Death Race (2008)** - A remake of the 1975 film \"Death Race 2000.\"\n",
      "5. **Pompeii (2014)** - A romantic historical disaster film set against the backdrop of the eruption of Mount Vesuvius.\n",
      "\n",
      "If you're interested in a specific genre or type of movie, let me know!\n",
      "\n",
      "--------------------------------------------------------------------------------\n",
      "\u001b[32m\n",
      "Next speaker: coder\n",
      "\u001b[0m\n",
      "\u001b[33mcoder\u001b[0m (to chat_manager):\n",
      "\n",
      "```cypher\n",
      "MATCH (p:Person {name: \"Paul W.S. Anderson\"})-[:DIRECTED]->(m:Movie)\n",
      "RETURN m.title AS Movie_Title, m.released AS Release_Year, m.tagline AS Tagline\n",
      "```\n",
      "\n",
      "--------------------------------------------------------------------------------\n",
      "\u001b[32m\n",
      "Next speaker: executor\n",
      "\u001b[0m\n",
      "\u001b[31m\n",
      ">>>>>>>> EXECUTING CODE BLOCK (inferred language is cypher)...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: released)} {position: line: 2, column: 34, offset: 102} for query: 'MATCH (p:Person {name: \"Paul W.S. Anderson\"})-[:DIRECTED]->(m:Movie)\\nRETURN m.title AS Movie_Title, m.released AS Release_Year, m.tagline AS Tagline\\n'\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: tagline)} {position: line: 2, column: 62, offset: 130} for query: 'MATCH (p:Person {name: \"Paul W.S. Anderson\"})-[:DIRECTED]->(m:Movie)\\nRETURN m.title AS Movie_Title, m.released AS Release_Year, m.tagline AS Tagline\\n'\n"
     ]
    },
    {
     "ename": "Neo4jError",
     "evalue": "{severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: released)} {position: line: 2, column: 34, offset: 102}",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNeo4jError\u001b[0m                                Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[24], line 1\u001b[0m\n\u001b[0;32m----> 1\u001b[0m \u001b[43mget_ipython\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun_cell_magic\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43mcypher\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43mMATCH (p:Person \u001b[39;49m\u001b[38;5;124;43m{\u001b[39;49m\u001b[38;5;124;43mname: \u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mPaul W.S. Anderson\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43m})-[:DIRECTED]->(m:Movie)\u001b[39;49m\u001b[38;5;130;43;01m\\n\u001b[39;49;00m\u001b[38;5;124;43mRETURN m.title AS Movie_Title, m.released AS Release_Year, m.tagline AS Tagline\u001b[39;49m\u001b[38;5;130;43;01m\\n\u001b[39;49;00m\u001b[38;5;124;43m'\u001b[39;49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m~/Scrivania/scuola/uni/traineeship/madt-mlagents/.venv/lib/python3.12/site-packages/IPython/core/interactiveshell.py:2541\u001b[0m, in \u001b[0;36mInteractiveShell.run_cell_magic\u001b[0;34m(self, magic_name, line, cell)\u001b[0m\n\u001b[1;32m   2539\u001b[0m \u001b[38;5;28;01mwith\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mbuiltin_trap:\n\u001b[1;32m   2540\u001b[0m     args \u001b[38;5;241m=\u001b[39m (magic_arg_s, cell)\n\u001b[0;32m-> 2541\u001b[0m     result \u001b[38;5;241m=\u001b[39m \u001b[43mfn\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m   2543\u001b[0m \u001b[38;5;66;03m# The code below prevents the output from being displayed\u001b[39;00m\n\u001b[1;32m   2544\u001b[0m \u001b[38;5;66;03m# when using magics with decorator @output_can_be_silenced\u001b[39;00m\n\u001b[1;32m   2545\u001b[0m \u001b[38;5;66;03m# when the last Python token in the expression is a ';'.\u001b[39;00m\n\u001b[1;32m   2546\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mgetattr\u001b[39m(fn, magic\u001b[38;5;241m.\u001b[39mMAGIC_OUTPUT_CAN_BE_SILENCED, \u001b[38;5;28;01mFalse\u001b[39;00m):\n",
      "File \u001b[0;32m~/Scrivania/scuola/uni/traineeship/madt-mlagents/tools/neo4j_tools.py:128\u001b[0m, in \u001b[0;36mcypher\u001b[0;34m(line, cell)\u001b[0m\n\u001b[1;32m    116\u001b[0m \u001b[38;5;250m\u001b[39m\u001b[38;5;124;03m\"\"\"\u001b[39;00m\n\u001b[1;32m    117\u001b[0m \u001b[38;5;124;03mIt registers the magic cypher to be used in the notebook\u001b[39;00m\n\u001b[1;32m    118\u001b[0m \u001b[38;5;124;03mby the executor agent.\u001b[39;00m\n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m    125\u001b[0m \u001b[38;5;124;03m    _type_: The result of the query, if it wasn't successful will be an empty list.\u001b[39;00m\n\u001b[1;32m    126\u001b[0m \u001b[38;5;124;03m\"\"\"\u001b[39;00m\n\u001b[1;32m    127\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m cell: res \u001b[38;5;241m=\u001b[39m run_query(line)\n\u001b[0;32m--> 128\u001b[0m \u001b[38;5;28;01melse\u001b[39;00m:  res \u001b[38;5;241m=\u001b[39m \u001b[43mrun_query\u001b[49m\u001b[43m(\u001b[49m\u001b[43mcell\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    129\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m res\n",
      "File \u001b[0;32m~/Scrivania/scuola/uni/traineeship/madt-mlagents/tools/neo4j_tools.py:64\u001b[0m, in \u001b[0;36mrun_query\u001b[0;34m(query, driver)\u001b[0m\n\u001b[1;32m     62\u001b[0m s \u001b[38;5;241m=\u001b[39m n\u001b[38;5;241m.\u001b[39mseverity_level\n\u001b[1;32m     63\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m s \u001b[38;5;241m==\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mWARNING\u001b[39m\u001b[38;5;124m\"\u001b[39m:\n\u001b[0;32m---> 64\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m Neo4jError(n)\n\u001b[1;32m     65\u001b[0m \u001b[38;5;28;01melif\u001b[39;00m s \u001b[38;5;241m==\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mINFORMATION\u001b[39m\u001b[38;5;124m\"\u001b[39m:\n\u001b[1;32m     66\u001b[0m     log\u001b[38;5;241m.\u001b[39mwarning(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;132;01m%r\u001b[39;00m\u001b[38;5;124m\"\u001b[39m, n)\n",
      "\u001b[0;31mNeo4jError\u001b[0m: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: released)} {position: line: 2, column: 34, offset: 102}"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\u001b[33mexecutor\u001b[0m (to chat_manager):\n",
      "\n",
      "exitcode: 1 (execution failed)\n",
      "Code output: \n",
      "{severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: released)} {position: line: 2, column: 34, offset: 102}\n",
      "\n",
      "--------------------------------------------------------------------------------\n",
      "\u001b[32m\n",
      "Next speaker: coder\n",
      "\u001b[0m\n",
      "\u001b[33mcoder\u001b[0m (to chat_manager):\n",
      "\n",
      "```cypher\n",
      "MATCH (p:Person {name: \"Paul W.S. Anderson\"})-[:DIRECTED]->(m:Movie)\n",
      "RETURN m.title AS Movie_Title, m.tagline AS Tagline\n",
      "```\n",
      "\n",
      "--------------------------------------------------------------------------------\n",
      "\u001b[32m\n",
      "Next speaker: executor\n",
      "\u001b[0m\n",
      "\u001b[31m\n",
      ">>>>>>>> EXECUTING CODE BLOCK (inferred language is cypher)...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: tagline)} {position: line: 2, column: 34, offset: 102} for query: 'MATCH (p:Person {name: \"Paul W.S. Anderson\"})-[:DIRECTED]->(m:Movie)\\nRETURN m.title AS Movie_Title, m.tagline AS Tagline\\n'\n"
     ]
    },
    {
     "ename": "Neo4jError",
     "evalue": "{severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: tagline)} {position: line: 2, column: 34, offset: 102}",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNeo4jError\u001b[0m                                Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[24], line 1\u001b[0m\n\u001b[0;32m----> 1\u001b[0m \u001b[43mget_ipython\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun_cell_magic\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43mcypher\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43mMATCH (p:Person \u001b[39;49m\u001b[38;5;124;43m{\u001b[39;49m\u001b[38;5;124;43mname: \u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mPaul W.S. Anderson\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43m})-[:DIRECTED]->(m:Movie)\u001b[39;49m\u001b[38;5;130;43;01m\\n\u001b[39;49;00m\u001b[38;5;124;43mRETURN m.title AS Movie_Title, m.tagline AS Tagline\u001b[39;49m\u001b[38;5;130;43;01m\\n\u001b[39;49;00m\u001b[38;5;124;43m'\u001b[39;49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m~/Scrivania/scuola/uni/traineeship/madt-mlagents/.venv/lib/python3.12/site-packages/IPython/core/interactiveshell.py:2541\u001b[0m, in \u001b[0;36mInteractiveShell.run_cell_magic\u001b[0;34m(self, magic_name, line, cell)\u001b[0m\n\u001b[1;32m   2539\u001b[0m \u001b[38;5;28;01mwith\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mbuiltin_trap:\n\u001b[1;32m   2540\u001b[0m     args \u001b[38;5;241m=\u001b[39m (magic_arg_s, cell)\n\u001b[0;32m-> 2541\u001b[0m     result \u001b[38;5;241m=\u001b[39m \u001b[43mfn\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m   2543\u001b[0m \u001b[38;5;66;03m# The code below prevents the output from being displayed\u001b[39;00m\n\u001b[1;32m   2544\u001b[0m \u001b[38;5;66;03m# when using magics with decorator @output_can_be_silenced\u001b[39;00m\n\u001b[1;32m   2545\u001b[0m \u001b[38;5;66;03m# when the last Python token in the expression is a ';'.\u001b[39;00m\n\u001b[1;32m   2546\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mgetattr\u001b[39m(fn, magic\u001b[38;5;241m.\u001b[39mMAGIC_OUTPUT_CAN_BE_SILENCED, \u001b[38;5;28;01mFalse\u001b[39;00m):\n",
      "File \u001b[0;32m~/Scrivania/scuola/uni/traineeship/madt-mlagents/tools/neo4j_tools.py:128\u001b[0m, in \u001b[0;36mcypher\u001b[0;34m(line, cell)\u001b[0m\n\u001b[1;32m    116\u001b[0m \u001b[38;5;250m\u001b[39m\u001b[38;5;124;03m\"\"\"\u001b[39;00m\n\u001b[1;32m    117\u001b[0m \u001b[38;5;124;03mIt registers the magic cypher to be used in the notebook\u001b[39;00m\n\u001b[1;32m    118\u001b[0m \u001b[38;5;124;03mby the executor agent.\u001b[39;00m\n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m    125\u001b[0m \u001b[38;5;124;03m    _type_: The result of the query, if it wasn't successful will be an empty list.\u001b[39;00m\n\u001b[1;32m    126\u001b[0m \u001b[38;5;124;03m\"\"\"\u001b[39;00m\n\u001b[1;32m    127\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m cell: res \u001b[38;5;241m=\u001b[39m run_query(line)\n\u001b[0;32m--> 128\u001b[0m \u001b[38;5;28;01melse\u001b[39;00m:  res \u001b[38;5;241m=\u001b[39m \u001b[43mrun_query\u001b[49m\u001b[43m(\u001b[49m\u001b[43mcell\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    129\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m res\n",
      "File \u001b[0;32m~/Scrivania/scuola/uni/traineeship/madt-mlagents/tools/neo4j_tools.py:64\u001b[0m, in \u001b[0;36mrun_query\u001b[0;34m(query, driver)\u001b[0m\n\u001b[1;32m     62\u001b[0m s \u001b[38;5;241m=\u001b[39m n\u001b[38;5;241m.\u001b[39mseverity_level\n\u001b[1;32m     63\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m s \u001b[38;5;241m==\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mWARNING\u001b[39m\u001b[38;5;124m\"\u001b[39m:\n\u001b[0;32m---> 64\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m Neo4jError(n)\n\u001b[1;32m     65\u001b[0m \u001b[38;5;28;01melif\u001b[39;00m s \u001b[38;5;241m==\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mINFORMATION\u001b[39m\u001b[38;5;124m\"\u001b[39m:\n\u001b[1;32m     66\u001b[0m     log\u001b[38;5;241m.\u001b[39mwarning(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;132;01m%r\u001b[39;00m\u001b[38;5;124m\"\u001b[39m, n)\n",
      "\u001b[0;31mNeo4jError\u001b[0m: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: tagline)} {position: line: 2, column: 34, offset: 102}"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\u001b[33mexecutor\u001b[0m (to chat_manager):\n",
      "\n",
      "exitcode: 1 (execution failed)\n",
      "Code output: \n",
      "{severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: tagline)} {position: line: 2, column: 34, offset: 102}\n",
      "\n",
      "--------------------------------------------------------------------------------\n",
      "\u001b[32m\n",
      "Next speaker: coder\n",
      "\u001b[0m\n",
      "\u001b[33mcoder\u001b[0m (to chat_manager):\n",
      "\n",
      "```cypher\n",
      "MATCH (p:Person {name: \"Paul W.S. Anderson\"})-[:DIRECTED]->(m:Movie)\n",
      "RETURN m.title AS Movie_Title\n",
      "```\n",
      "\n",
      "--------------------------------------------------------------------------------\n",
      "\u001b[32m\n",
      "Next speaker: executor\n",
      "\u001b[0m\n",
      "\u001b[31m\n",
      ">>>>>>>> EXECUTING CODE BLOCK (inferred language is cypher)...\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[{'Movie_Title': 'Mortal Kombat'}, {'Movie_Title': 'Shopping'}]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\u001b[33mexecutor\u001b[0m (to chat_manager):\n",
      "\n",
      "exitcode: 0 (execution succeeded)\n",
      "Code output: [{'Movie_Title': 'Mortal Kombat'}, {'Movie_Title': 'Shopping'}]\n",
      "\n",
      "--------------------------------------------------------------------------------\n",
      "\u001b[32m\n",
      "Next speaker: coder\n",
      "\u001b[0m\n",
      "\u001b[33mcoder\u001b[0m (to chat_manager):\n",
      "\n",
      "| Movie_Title      |\n",
      "|-------------------|\n",
      "| Mortal Kombat     |\n",
      "| Shopping          |\n",
      "\n",
      "--------------------------------------------------------------------------------\n",
      "\u001b[32m\n",
      "Next speaker: recommender\n",
      "\u001b[0m\n",
      "\u001b[33mrecommender\u001b[0m (to chat_manager):\n",
      "\n",
      "Here are two movies directed by Paul W.S. Anderson:\n",
      "\n",
      "1. **Mortal Kombat**\n",
      "2. **Shopping**\n",
      "\n",
      "If you need more information or further recommendations, feel free to ask!\n",
      "\n",
      "--------------------------------------------------------------------------------\n",
      "\u001b[32m\n",
      "Next speaker: coder\n",
      "\u001b[0m\n",
      "\u001b[33mcoder\u001b[0m (to chat_manager):\n",
      "\n",
      "\n",
      "\n",
      "--------------------------------------------------------------------------------\n",
      "\u001b[32m\n",
      "Next speaker: recommender\n",
      "\u001b[0m\n",
      "\u001b[33mrecommender\u001b[0m (to chat_manager):\n",
      "\n",
      "TERMINATE\n",
      "\n",
      "--------------------------------------------------------------------------------\n"
     ]
    }
   ],
   "source": [
    "#### START OF THE GROUP CHAT ####\n",
    "rag_chat()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
